#include<iostream>
#include<Windows.h>
using namespace std;
int main() {
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    int x, b, d, z, x2, x3;
    cout << "\t\tвиберiть та введiть номер варiанту\n";
    cout << "#1 введiть бажаний дохiд Васi та кiлькiсть запiзнень,порахувати, скiльки рядкiв коду йому треба написати\n";
    cout << "#2 користувач вводить кiлькiсть рядкiв коду, написане Васею i бажаний обсяг зарплати.Порахувати, скiльки разiв Вася може запiзнитися\n";
    cout << "#3 користувач вводить кiлькiсть рядкiв коду i кiлькiсть запiзнень, визначити, скiльки грошей заплатять Васi i чи заплатять взагалі.\n";
    cin >> b;
    if (b < 1 || b>3)  cout << "невiрний ввiд\n";
    else  if (b == 1) {
        cout << "ведiть Бажаний дохiд Васi\n";
        cin >> d;
        cout << "введiть кiлькiсть запiзнень\n";
        cin >> z;
        cout << (d / 50 * 100) + (z / 3 * 20);
    }
    else
        if (b == 2) {
            cout << "введiть кiлькiсть рядкiв коду\n";
            cin >> x;
            cout << "ведiть бажаний дохiд Васi\n";
            cin >> d;
            if (x / 2 <= d)cout << "не можна пропускать\n";
            else
                cout << (x / 2 - d) / 20 << "раз можна пропустити\n";
        }
        else
            if (b == 3) {
                cout << "введiть кiлькiсть рядкiв коду\n";
                cin >> x;
                cout << "введiть кiлькiсть запiзнень\n";
                cin >> z;
                x2 = ((x / 2) - (z / 3 * 20));
                x3 = x2 / 20;
                if (x3 > 0)cout << x2 << " $ ЗП Васi в цьому мiсяцi\n";
                else cout << "не заплатять\n";
            }
}
